#ifndef _FMS_CLIENT_H_
#define _FMS_CLIENT_H_

/*================================================================================================
공용 함수로 main에서 호출함으로 다른 모듈에서 호출 하면 안됨.(다른 파일에서 호출 하지 마세요)
================================================================================================*/
int init_fms_client( send_data_func ptrsend_data );
int idle_fms_client( void * ptr );
int release_fms_client( void );

/*================================================================================================
  CONTROL Module에서 센서 데이터나 장애 데이터를 받을 수 있는 함수.(다른 파일에서 호출하지 마세요)
================================================================================================*/
int recv_sns_data_fms_client( unsigned short inter_msg, void * ptrdata );	


#endif
