#ifndef _MCU_H_
#define _MCU_H_

/*================================================================================================
공용 함수로 main에서 호출함으로 다른 모듈에서 호출 하면 안됨.(다른 파일에서 호출 하지 마세요)
================================================================================================*/
int init_mcu( send_data_func ptrsend_data );
int idle_mcu( void * ptr );
int release_mcu( void );

/*================================================================================================
  CONTROL Module에서 제어나 설정 데이터를 받 을 수 있는 함수.(다른 파일에서 호출하지 마세요)
================================================================================================*/
int recv_ctrl_data_mcu( unsigned short inter_msg, void * ptrdata );	


//int set_doe_remote_mcu( int val );
//int get_doe_remote_mcu( void );

#endif
