#ifndef _PWR_C_H_
#define _PWR_C_H_

/*================================================================================================
공용 함수로 main에서 호출함으로 다른 모듈에서 호출 하면 안됨.(다른 파일에서 호출 하지 마세요)
================================================================================================*/
int init_pwr_c( send_data_func ptrsend_data );
int idle_pwr_c( void * ptr );
int release_pwr_c( void );

/*================================================================================================
  CONTROL Module에서 제어나 설정 데이터를 받 을 수 있는 함수.(다른 파일에서 호출하지 마세요)
================================================================================================*/
int recv_ctrl_data_pwr_c( unsigned short inter_msg, void * ptrdata );	

#endif
