#ifndef _APC_UPS_H_
#define _APC_UPS_H_

/*================================================================================================
공용 함수로 main에서 호출함으로 다른 모듈에서 호출 하면 안됨.   
================================================================================================*/
int init_apc_ups( send_data_func ptrsend_data );
int idle_apc_ups( void * ptr );
int release_apc_ups( void );

/*================================================================================================
  CONTROL Module에서 센서 데이터나 장애 데이터를 받을 수 있는 함수.
================================================================================================*/
int recv_ctrl_data_apc_ups( unsigned short msg, void * ptrdata );	

#endif
